Revit 2027 API
MEPSystem.GetCriticalPathSectionNumbers Method
 Obtains a list of the critical path section numbers.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<int> GetCriticalPathSectionNumbers()
Public Function GetCriticalPathSectionNumbers As IList(Of Integer)
public:
IList<int>^ GetCriticalPathSectionNumbers()
member GetCriticalPathSectionNumbers : unit -> IList<int>
Return Value
IList<Int32>
 The section numbers.
Remarks
 The section numbers are returned in order in the direction of flow.
See Also
Reference
MEPSystem Class
Autodesk.Revit.DB Namespace